infiniteFast/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


combustionModel noCombustion<psiThermoCombustion>;

noCombustionCoeffs
{
}


/*
combustionModel    infinitelyFastChemistry<psiThermoCombustion,gasHThermoPhysics>;

active  true;

infinitelyFastChemistryCoeffs
{
    semiImplicit    no;
    C               10;
}
*/

/*
combustionModel diffusion<psiThermoCombustion,gasHThermoPhysics>

active  true;

diffusionCoeffs
{
    semiImplicit    no;
    C               10;
}
*/

/*
combustionModel  PaSR<psiChemistryCombustion>;

active  true;

PaSRCoeffs
{
    Cmix                0.1;
    turbulentReaction   on;
    useReactionRate     true;
}
*/

/*
combustionModel  laminar<psiChemistryCombustion>;

active  true;

laminarCoeffs
{
}
*/

// ************************************************************************* //

/*
Unknown psiCombustionModel type infinitelyFastChemistry<psiChemistryCombustion>

Valid  combustionModels are : 

15
(
noCombustion<psiThermoCombustion>
infinitelyFastChemistry<psiThermoCombustion,gasHThermoPhysics>
diffusion<psiThermoCombustion,constGasEThermoPhysics>
infinitelyFastChemistry<psiThermoCombustion,constGasEThermoPhysics>
PaSR<psiChemistryCombustion>
laminar<psiChemistryCombustion>
FSD<psiThermoCombustion,constGasHThermoPhysics>
infinitelyFastChemistry<psiThermoCombustion,constGasHThermoPhysics>
diffusion<psiThermoCombustion,gasEThermoPhysics>
diffusion<psiThermoCombustion,constGasHThermoPhysics>
diffusion<psiThermoCombustion,gasHThermoPhysics>
infinitelyFastChemistry<psiThermoCombustion,gasEThermoPhysics>
FSD<psiThermoCombustion,gasEThermoPhysics>
FSD<psiThermoCombustion,constGasEThermoPhysics>
FSD<psiThermoCombustion,gasHThermoPhysics>
) 
 */
